app/views/time_entries/_time_entry_form.html.erb

	<div class="span2">
		<%= f.input :project_id, collection: Project.all, :label_method=>:name, :value_method=>:id %>
---
SELECT "projects".* FROM "projects"