app/controllers/time_entries_controller.rb

INSERT INTO "time_entries" ("billable", "created_at", "description", "effective_date", "minutes", "organization_id", "project_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create

		@time_entry= TimeEntry.new(params[:time_entry])
		@time_entry.organization = @org_id
		@time_entry.user_id = current_user.id

		if @time_entry.save